{
  "nodes": [
    {
      "op": "null", 
      "name": "Parameter696", 
      "attrs": {"__shape__": "(256,)"}, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape9", 
      "attrs": {"shape": "(1, -1, 1, 1)"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Parameter676", 
      "attrs": {"__shape__": "(256,)"}, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape8", 
      "attrs": {"shape": "(1, -1, 1, 1)"}, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Parameter656", 
      "attrs": {"__shape__": "(256,)"}, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape7", 
      "attrs": {"shape": "(1, -1, 1, 1)"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Parameter616", 
      "attrs": {"__shape__": "(256,)"}, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape6", 
      "attrs": {"shape": "(1, -1, 1, 1)"}, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Parameter596", 
      "attrs": {"__shape__": "(256,)"}, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape5", 
      "attrs": {"shape": "(1, -1, 1, 1)"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Parameter576", 
      "attrs": {"__shape__": "(256,)"}, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape4", 
      "attrs": {"shape": "(1, -1, 1, 1)"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Parameter84", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape3", 
      "attrs": {"shape": "(1, -1, 1, 1)"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Parameter64", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape2", 
      "attrs": {"shape": "(1, -1, 1, 1)"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Parameter24", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attrs": {"shape": "(1, -1, 1, 1)"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Parameter4", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attrs": {"shape": "(1, -1, 1, 1)"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Input2505", 
      "inputs": []
    }, 
    {
      "op": "Pad", 
      "name": "pad0", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Parameter3", 
      "attrs": {"__shape__": "(64, 1, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add0", 
      "inputs": [[19, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "ReLU2514", 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad1", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Parameter23", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add1", 
      "inputs": [[17, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "ReLU2532", 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad2", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "Dropout2556", 
      "attrs": {
        "mode": "training", 
        "p": "0.25"
      }, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad3", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Parameter63", 
      "attrs": {"__shape__": "(128, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add2", 
      "inputs": [[15, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "ReLU2570", 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad4", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Parameter83", 
      "attrs": {"__shape__": "(128, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3", 
      "inputs": [[13, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "ReLU2588", 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad5", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling1", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "Dropout2612", 
      "attrs": {
        "mode": "training", 
        "p": "0.25"
      }, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad6", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Parameter575", 
      "attrs": {"__shape__": "(256, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution4", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add4", 
      "inputs": [[11, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "ReLU2626", 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad7", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Parameter595", 
      "attrs": {"__shape__": "(256, 256, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution5", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[52, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add5", 
      "inputs": [[9, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "ReLU2644", 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad8", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Parameter615", 
      "attrs": {"__shape__": "(256, 256, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution6", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add6", 
      "inputs": [[7, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "ReLU2662", 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad9", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[61, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling2", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "Dropout2686", 
      "attrs": {
        "mode": "training", 
        "p": "0.25"
      }, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad10", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Parameter655", 
      "attrs": {"__shape__": "(256, 256, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution7", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[65, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add7", 
      "inputs": [[5, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "ReLU2700", 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad11", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Parameter675", 
      "attrs": {"__shape__": "(256, 256, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution8", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add8", 
      "inputs": [[3, 0, 0], [72, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "ReLU2718", 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad12", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Parameter695", 
      "attrs": {"__shape__": "(256, 256, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution9", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add9", 
      "inputs": [[1, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "ReLU2736", 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad13", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling3", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "Dropout2760", 
      "attrs": {
        "mode": "training", 
        "p": "0.25"
      }, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "Times2770_reshape0", 
      "attrs": {"shape": "(1, 4096)"}, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Parameter1367", 
      "attrs": {"__shape__": "(256, 4, 4, 1024)"}, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "Times2770_reshape1", 
      "attrs": {"shape": "(4096, 1024)"}, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "_linalg_gemm2", 
      "name": "Times2770", 
      "inputs": [[83, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Parameter1368", 
      "attrs": {"__shape__": "(1, 1024)"}, 
      "inputs": []
    }, 
    {
      "op": "elemwise_add", 
      "name": "Plus2772", 
      "inputs": [[86, 0, 0], [87, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "ReLU2784", 
      "inputs": [[88, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "Dropout2794", 
      "attrs": {
        "mode": "training", 
        "p": "0.5"
      }, 
      "inputs": [[89, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Parameter1403", 
      "attrs": {"__shape__": "(1024, 1024)"}, 
      "inputs": []
    }, 
    {
      "op": "_linalg_gemm2", 
      "name": "Times2804", 
      "inputs": [[90, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Parameter1404", 
      "attrs": {"__shape__": "(1, 1024)"}, 
      "inputs": []
    }, 
    {
      "op": "elemwise_add", 
      "name": "Plus2806", 
      "inputs": [[92, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "ReLU2818", 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "Dropout2828", 
      "attrs": {
        "mode": "training", 
        "p": "0.5"
      }, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Parameter1693", 
      "attrs": {"__shape__": "(1024, 8)"}, 
      "inputs": []
    }, 
    {
      "op": "_linalg_gemm2", 
      "name": "Times2838", 
      "inputs": [[96, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Parameter1694", 
      "attrs": {"__shape__": "(1, 8)"}, 
      "inputs": []
    }, 
    {
      "op": "elemwise_add", 
      "name": "Plus2840", 
      "inputs": [[98, 0, 0], [99, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    4, 
    6, 
    8, 
    10, 
    12, 
    14, 
    16, 
    18, 
    20, 
    22, 
    27, 
    35, 
    40, 
    48, 
    53, 
    58, 
    66, 
    71, 
    76, 
    84, 
    87, 
    91, 
    93, 
    97, 
    99
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    103, 
    104, 
    105, 
    106, 
    107
  ], 
  "heads": [[100, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10200]}
}